{
    "reviews": [
      {
        "author": "Armin K.",
        "rating": 5,
        "text": "I started my capoeira classes with Calado around 6 months ago, and have had an amazing experience ever since. Each class is designed to cater to the participants, and various capoeira moves are taught with variations for students at different levels. Calado also makes sure to share relevant documents and videos to spread the knowledge about this art, which helps to keep students motivated. In addition, everyone in the class is very friendly and welcoming. I have always recommended this class to my friends, and will continue to do so.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Jose C.",
        "rating": 5,
        "text": "This movement guy is amazing. Chris shares knowledge of Capoeira and shows you how to achieve flow state. If you ever want to increase your movement practice with another style... come to this class! 10/10 would recommend.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Omar K.",
        "rating": 5,
        "text": "Chris is a great instructor who has a wealth of experience in physical fitness with a constant thirst to learn more and transfer those teachings into class. His teaching skills are showcased by his ability to work with anyone regardless of their physical fitness level and let them have a great workout while enjoying and appreciating Capoeria. With my time attending Chris’s class, I gained a plethora of stretches and exercises that are fun to do at home. Definitely worth checking out if your in the mood to have a fun and diverse workout!",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Wendy S.",
        "rating": 5,
        "text": "Overall a great experience from day one. The environment is peaceful, the teacher is very attentive and knowledgeable and the regulars are kind people who don’t mind spending extra time to help you understand. Calado has reached out to me directly to give feedback as well as study guides and links to further my practice. 10/10 would recommend whether you’re seriously interested in Capoeira or just looking for new things to try.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Updendra Y.",
        "rating": 5,
        "text": "Not only did Calado has a deep understanding of the techniques and movements involved in Capoeira, but he also brought a fun and energetic spirit to the class. He made learning a new skill exciting and engaging, and I was always eager to attend each session.</br></br>Calado provided clear and concise instructions, and was always available to provide individualized feedback and support. He encouraged us to push ourselves and strive for improvement, and I could see my own progress as the class went on. The overall atmosphere was supportive and inclusive, and I felt welcomed and valued as a member of the class.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Joseph C.",
        "rating": 5,
        "text": "Honestly one of the best first-time learning experiences I've ever had! I'm planning to start attending the Chris' (Calado's) lessons regularly and have already convinced some friends to join me sometimes, too. He is very patient and recognizes when to slow things down when it seems like anyone might be struggling with getting the moves down. Absolutely recommend trying capoeria out with Dende Arts!",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Shin C.",
        "rating": 5,
        "text": "This is an excellent place to learn creative movement with a knowledgeable Capoeira instructor in body mechanics and artistic flow. The instructor, Calado, works well with all levels and gives excellent feedback to develop and improve your skills. He goes above and beyond by providing resources to further help learn more about Capoeira. Class can be intense but FUN! (Bring plenty of water!!)",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Ethica M.",
        "rating": 5,
        "text": "Calado is an excellent teacher who looks to stretch the boundaries of capoeira knowledge for beginners and experts alike. By also focusing on stretches, students learn habits that ensure their safety while trying out new moves. While classes are currently online, the interactive teaching environment and the variety of moves taught keeps classes exciting.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Claire H.",
        "rating": 5,
        "text": "Wonderful well-rounded teaching. Calado does a great job of breaking down movements so they're accessible to people at every level. His motivation and dedication are evident, and he will happily take the time to explore and explain concepts, whether relating to capoeira movement, music, or history. Highly recommend!",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Brent J.",
        "rating": 5,
        "text": "I’m very happy to have found this class and can recommend it to anyone who wants to get started with Capoeira. Trying something new can be intimidating, but Calado broke down the movements in a very clear and easy to understand way. He led us through several warm ups that emphasized balance and flexibility. I will certainly want to incorporate these into my personal training regime.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Matias A.",
        "rating": 5,
        "text": "Calado is a great guy and teacher! He manages to explain very well how to do the capoeira moves, and is very attentive to each student's learning pace. I really like doing capoeira with him and definitely would recommend him as a good teacher for new people interested in learning capoeira.",
        "platform": "Google",
        "relationship": "Student"
      },
      {
        "author": "Imani G.",
        "rating": 5,
        "text": "Great class! Challenging, but so much fun! Would definitely return. The instructor is very passionate and knowledgeable about Capoeira. He also makes the class easy to follow, which is great for those (like me) who have no prior experience. After one class, I feel like I've already learned so much. Make sure to bring water because it is a serious work out.",
        "platform": "Google",
        "relationship": "Student"
      }
    ]
  }